data/2-replicas/1-producers/1-consumers/30-throughput/3-trial/producer.txt
2018-11-25 00:32:55, 292650 records sent, 58530.0 records/sec (28.58 MB/sec), 56.0 ms avg latency, 285.0 max latency.
2018-11-25 00:33:00, 278603 records sent, 55720.6 records/sec (27.21 MB/sec), 461.8 ms avg latency, 684.0 max latency.
2018-11-25 00:33:05, 261268 records sent, 52253.6 records/sec (25.51 MB/sec), 882.5 ms avg latency, 1194.0 max latency.
2018-11-25 00:33:10, 332785 records sent, 66557.0 records/sec (32.50 MB/sec), 456.8 ms avg latency, 797.0 max latency.
2018-11-25 00:33:15, 299717 records sent, 59943.4 records/sec (29.27 MB/sec), 13.2 ms avg latency, 118.0 max latency.
2018-11-25 00:33:20, 292980 records sent, 58596.0 records/sec (28.61 MB/sec), 3.1 ms avg latency, 17.0 max latency.
2018-11-25 00:33:25, 293013 records sent, 58602.6 records/sec (28.61 MB/sec), 3.1 ms avg latency, 14.0 max latency.
2018-11-25 00:33:30, 293074 records sent, 58614.8 records/sec (28.62 MB/sec), 2.8 ms avg latency, 18.0 max latency.
2018-11-25 00:33:35, 293030 records sent, 58606.0 records/sec (28.62 MB/sec), 2.5 ms avg latency, 17.0 max latency.
2018-11-25 00:33:40, 293043 records sent, 58608.6 records/sec (28.62 MB/sec), 2.5 ms avg latency, 19.0 max latency.
2018-11-25 00:33:45, 293040 records sent, 58608.0 records/sec (28.62 MB/sec), 2.6 ms avg latency, 10.0 max latency.
2018-11-25 00:33:50, 293025 records sent, 58605.0 records/sec (28.62 MB/sec), 2.6 ms avg latency, 31.0 max latency.
2018-11-25 00:33:55, 293009 records sent, 58601.8 records/sec (28.61 MB/sec), 2.8 ms avg latency, 14.0 max latency.
2018-11-25 00:34:02, 109562 records sent, 14563.6 records/sec (7.11 MB/sec), 2.5 ms avg latency, 5659.0 max latency.
2018-11-25 00:34:07, 344069 records sent, 68813.8 records/sec (33.60 MB/sec), 1780.9 ms avg latency, 5662.0 max latency.
2018-11-25 00:34:12, 339295 records sent, 67859.0 records/sec (33.13 MB/sec), 940.0 ms avg latency, 977.0 max latency.
2018-11-25 00:34:17, 347324 records sent, 69464.8 records/sec (33.92 MB/sec), 911.2 ms avg latency, 960.0 max latency.
2018-11-25 00:34:22, 335885 records sent, 67177.0 records/sec (32.80 MB/sec), 938.8 ms avg latency, 1003.0 max latency.
2018-11-25 00:34:27, 336226 records sent, 67245.2 records/sec (32.83 MB/sec), 948.7 ms avg latency, 990.0 max latency.
2018-11-25 00:34:32, 354020 records sent, 70804.0 records/sec (34.57 MB/sec), 854.6 ms avg latency, 951.0 max latency.
2018-11-25 00:34:37, 325689 records sent, 65137.8 records/sec (31.81 MB/sec), 183.5 ms avg latency, 562.0 max latency.
2018-11-25 00:34:42, 293003 records sent, 58600.6 records/sec (28.61 MB/sec), 2.7 ms avg latency, 12.0 max latency.
2018-11-25 00:34:47, 293027 records sent, 58605.4 records/sec (28.62 MB/sec), 3.0 ms avg latency, 14.0 max latency.
2018-11-25 00:34:52, 292957 records sent, 58591.4 records/sec (28.61 MB/sec), 2.9 ms avg latency, 16.0 max latency.
2018-11-25 00:34:57, 293028 records sent, 58605.6 records/sec (28.62 MB/sec), 2.5 ms avg latency, 12.0 max latency.
2018-11-25 00:35:02, 293142 records sent, 58628.4 records/sec (28.63 MB/sec), 2.8 ms avg latency, 12.0 max latency.
2018-11-25 00:35:07, 202256 records sent, 38096.8 records/sec (18.60 MB/sec), 3.1 ms avg latency, 1861.0 max latency.
2018-11-25 00:35:12, 100657 records sent, 20131.4 records/sec (9.83 MB/sec), 3682.2 ms avg latency, 5356.0 max latency.
2018-11-25 00:35:17, 356903 records sent, 71380.6 records/sec (34.85 MB/sec), 895.2 ms avg latency, 964.0 max latency.
2018-11-25 00:35:22, 356996 records sent, 71399.2 records/sec (34.86 MB/sec), 893.2 ms avg latency, 942.0 max latency.
2018-11-25 00:35:27, 341899 records sent, 68379.8 records/sec (33.39 MB/sec), 917.1 ms avg latency, 967.0 max latency.
2018-11-25 00:35:32, 324942 records sent, 64988.4 records/sec (31.73 MB/sec), 976.4 ms avg latency, 1000.0 max latency.
2018-11-25 00:35:37, 334676 records sent, 66935.2 records/sec (32.68 MB/sec), 942.9 ms avg latency, 991.0 max latency.
2018-11-25 00:35:42, 340101 records sent, 68020.2 records/sec (33.21 MB/sec), 510.0 ms avg latency, 872.0 max latency.
2018-11-25 00:35:50, 288727 records sent, 37082.8 records/sec (18.11 MB/sec), 4.9 ms avg latency, 2928.0 max latency.
2018-11-25 00:35:55, 366322 records sent, 73264.4 records/sec (35.77 MB/sec), 1197.5 ms avg latency, 2930.0 max latency.
2018-11-25 00:36:00, 352005 records sent, 70401.0 records/sec (34.38 MB/sec), 894.2 ms avg latency, 970.0 max latency.
2018-11-25 00:36:05, 332078 records sent, 66415.6 records/sec (32.43 MB/sec), 239.1 ms avg latency, 671.0 max latency.
2018-11-25 00:36:10, 293051 records sent, 58610.2 records/sec (28.62 MB/sec), 2.7 ms avg latency, 8.0 max latency.
2018-11-25 00:36:15, 292963 records sent, 58592.6 records/sec (28.61 MB/sec), 2.6 ms avg latency, 22.0 max latency.
2018-11-25 00:36:21, 29095 records sent, 4880.1 records/sec (2.38 MB/sec), 3.6 ms avg latency, 5469.0 max latency.
2018-11-25 00:36:26, 350104 records sent, 70020.8 records/sec (34.19 MB/sec), 1716.7 ms avg latency, 5471.0 max latency.
2018-11-25 00:36:31, 354702 records sent, 70940.4 records/sec (34.64 MB/sec), 900.5 ms avg latency, 936.0 max latency.
2018-11-25 00:36:36, 343821 records sent, 68764.2 records/sec (33.58 MB/sec), 917.1 ms avg latency, 980.0 max latency.
2018-11-25 00:36:41, 352408 records sent, 70481.6 records/sec (34.41 MB/sec), 904.8 ms avg latency, 944.0 max latency.
2018-11-25 00:36:46, 355260 records sent, 71052.0 records/sec (34.69 MB/sec), 806.7 ms avg latency, 916.0 max latency.
2018-11-25 00:36:51, 321941 records sent, 64388.2 records/sec (31.44 MB/sec), 147.5 ms avg latency, 499.0 max latency.
2018-11-25 00:36:56, 292482 records sent, 58496.4 records/sec (28.56 MB/sec), 2.3 ms avg latency, 18.0 max latency.
2018-11-25 00:37:01, 293561 records sent, 58712.2 records/sec (28.67 MB/sec), 2.2 ms avg latency, 14.0 max latency.
2018-11-25 00:37:06, 293076 records sent, 58603.5 records/sec (28.61 MB/sec), 2.4 ms avg latency, 21.0 max latency.
2018-11-25 00:37:11, 293003 records sent, 58600.6 records/sec (28.61 MB/sec), 2.5 ms avg latency, 17.0 max latency.
2018-11-25 00:37:16, 292986 records sent, 58597.2 records/sec (28.61 MB/sec), 2.5 ms avg latency, 11.0 max latency.
2018-11-25 00:37:21, 292982 records sent, 58596.4 records/sec (28.61 MB/sec), 2.5 ms avg latency, 16.0 max latency.
2018-11-25 00:37:27, 273158 records sent, 44079.1 records/sec (21.52 MB/sec), 2.5 ms avg latency, 1537.0 max latency.
2018-11-25 00:37:32, 104470 records sent, 20894.0 records/sec (10.20 MB/sec), 3399.8 ms avg latency, 5252.0 max latency.
2018-11-25 00:37:37, 354826 records sent, 70965.2 records/sec (34.65 MB/sec), 886.7 ms avg latency, 960.0 max latency.
2018-11-25 00:37:42, 360282 records sent, 72056.4 records/sec (35.18 MB/sec), 881.5 ms avg latency, 923.0 max latency.
2018-11-25 00:37:47, 345495 records sent, 69099.0 records/sec (33.74 MB/sec), 911.7 ms avg latency, 969.0 max latency.
2018-11-25 00:37:52, 330243 records sent, 66048.6 records/sec (32.25 MB/sec), 961.6 ms avg latency, 993.0 max latency.
2018-11-25 00:37:57, 334304 records sent, 66860.8 records/sec (32.65 MB/sec), 691.6 ms avg latency, 970.0 max latency.
2018-11-25 00:38:02, 311283 records sent, 62256.6 records/sec (30.40 MB/sec), 71.5 ms avg latency, 318.0 max latency.
2018-11-25 00:38:07, 293027 records sent, 58605.4 records/sec (28.62 MB/sec), 2.7 ms avg latency, 17.0 max latency.
2018-11-25 00:38:12, 293012 records sent, 58602.4 records/sec (28.61 MB/sec), 2.6 ms avg latency, 18.0 max latency.
2018-11-25 00:38:17, 292913 records sent, 58582.6 records/sec (28.60 MB/sec), 2.4 ms avg latency, 6.0 max latency.
2018-11-25 00:38:22, 292965 records sent, 58593.0 records/sec (28.61 MB/sec), 2.6 ms avg latency, 18.0 max latency.
2018-11-25 00:38:27, 293036 records sent, 58607.2 records/sec (28.62 MB/sec), 2.3 ms avg latency, 18.0 max latency.
2018-11-25 00:38:32, 292971 records sent, 58594.2 records/sec (28.61 MB/sec), 2.4 ms avg latency, 7.0 max latency.
2018-11-25 00:38:41, 196160 records sent, 22793.4 records/sec (11.13 MB/sec), 3.3 ms avg latency, 5261.0 max latency.
2018-11-25 00:38:46, 354140 records sent, 70828.0 records/sec (34.58 MB/sec), 1660.4 ms avg latency, 5262.0 max latency.
2018-11-25 00:38:51, 332196 records sent, 66439.2 records/sec (32.44 MB/sec), 956.6 ms avg latency, 997.0 max latency.
2018-11-25 00:38:53, 21093750 records sent, 58085.981710 records/sec (28.36 MB/sec), 499.59 ms avg latency, 5662.00 ms max latency, 210 ms 50th, 975 ms 95th, 5218 ms 99th, 5619 ms 99.9th.